taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC1700_DFP.2.3.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LPC1700_DFP</name>
  <description>NXP LPC1700 Series Device Support, Drivers and Examples for MCB1700 and LPC1788-32</description>

  <releases>
    <release version="2.3.0" date="2017-01-13">
      CMSIS-PACK Description:
      - Reworked board description.
      - Trace Start/Stop debug sequence added
      - moved dbgconf file name to dedicated folder and updated the file name
      - Updated version of config file system_LPC177x_8x.c: was not updated in pack version 2.1.0
      Device Support:
      - Updated system_LPC177x_8x.[c|h]. correcting doxy comments
      - Corrected PIN_LPC177x_8x.c to support also PORT4 and PORT5
      - Updated RTE_device for LPC177x/8x.
      - Update Device header file LPC177x_8x.h adding System Control register MATRIXARB
      CMSIS-Driver:
      - Updated GPDMA driver to transfer data bigger than 4k.
      -- Updated CMSIS drivers (USART, I2S and SSP) to work with new GPDMA driver.
      - Updated USB Device driver:
      -- USBD_HW_ReadEP/USBD_HW_WriteEP function behavior for data parameter equal to NULL
      -- EndpointUnconfigure function for isochronous endpoints (unconfiguring one isochronous endpoint prevented further functionality of any other configured isochronous endpoints)
      -- updated the driver to work with LPC1751/52 device series
      -- removed unnecessary __packed specifier for GCC compliance
      - Updated USART driver:
      -- Corrected send_active flag handling in USART_Send function.
      -- TX and RX pins can be configured as "not used"
      - Updated SSP and SPI driver: MISO and MOSI pins can be configured as "not used"
      - Updated CAN driver:
      -- corrected receive overrun signaling
      -- corrected functionality when NULL pointer is provided for one or both signal callbacks in Initialize function call
      Board Examples:
      - Added USB Device Audio example for Keil MCB1700 evaluation board
      - Added CAN Data example for Embedded Artists LPC1788-32 Developers Kit
      - Updated emWin examples to emWin V5.36f
      - Updated USB Device CDC ACM VirtualCOM example for Keil MCB1700 and EA LPC1788-32 Developers Kit evaluation boards
      - Updated USB Host examples
    </release>
    <release version="2.2.0" date="2015-12-21">
      Updated CMSIS drivers:
      - Added CAN and SPI driver and respective configuration options in RTE_Device.h
      - Updated USB Device driver:
      -- added check for USBD_EndpointConfigure function: allow only endpoint configuration supported by hardware
      -- corrected SetLineCoding request on CDC ACM device
      -- corrected reading data from stalled endpoint causing hardfault
      -- corrected initialization failure if Port1 not enabled in RTE_Device.h
      - Updated USB Host driver:
      -- corrected PowerControl for Power OFF
      -- corrected initialization failure if Port1 not enabled in RTE_Device.h
      - Updated SSP driver:
      -- correcting ssel pin GPIO mode configuration (for LPC177x_8x)
      -- corrected Bus Speed configuration
      Updated EMAC driver:
      - corrected return value of the ReadFrame function
      - corrected PHY device addressing when using software controlled MDI
      MDK example projects:
      - added CAN Data project for Keil MCB1700 Evaluation Board
      - added LPC1758 Flash Target in Network examples to support MCB1700 board populated with LPC1758 device
    </release>
    <release version="2.1.0" date="2015-06-19">
      Added full support for LPC177x/8x devices:
      -- CMSIS and Peripheral drivers
      -- Board support and examples for Embedded Artists LPC1788-32 DK
      -- External Memory Controller configuration in system file
      Added new CMSIS drivers:
      -- SAI/I2S driver
      -- MCI driver for LPC177x/8x devices
      Updated CMSIS drivers:
      - Driver configuration (RTE_Device.h): added support for new drivers and LPC177x/8x devices
      - I2C, EMAC, SPI, USART, USB Device, USB Host: Updated initialization, uninitialization and power procedures
      - SPI, USART: Corrected status bit-field race conditions
      - SPI: corrected ARM_SPI_EVENT_DATA_LOST event handling in slave mode
      - EMAC:
      -- corrected return value of PHY_Read function
      -- GetMacAddress function implemented
      -- corrected MDC clock divider setting for Ethernet PHY
      -- corrected no communication after cable reconnected
      - USART:
      -- corrected disabling of receive DMA channel when aborting Receive or Transfer
      -- fract_div_lookup_table moved from header file to driver .c file
      -- improved baudrate calculation
      -- corrected RX Time-out handling
      -- corrected USART clock configuration
      - USB Device:
      -- added support for LPC177x/8x devices
      -- added support for isochronous endpoints
      - USB Host:
      -- added support for LPC177x/8x devices
      Updated SVD file for LPC175x/6x: corrected USB base address
      Updated drivers:
      - PIN: added support for LPC177x/8x devices
      - GPDMA: added GPDMA_ChannelGetCount function
      - OTG: added support for LPC177x/8x devices
      Updated examples for Keil MCB1700 Board
    </release>
    <release version="2.0.0" date="2014-07-09">
      - Added CMSIS-Driver 2.2.0 compliant drivers for LPC175x and LPC176x Device Series
      - Added MDK-Middleware examples for MCB1700 Development Board (requires MDK-Middleware Pack 6.1.0 or higher)
    </release>
    <release version="1.0.2">
      Renamed Device Sub-Families.
    </release>
    <release version="1.0.1">
      MCB1700 added.
    </release>
    <release version="1.0.0">
      First Release version of LPC1700 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>LPC1700</keyword>
    <keyword>LPC17xx</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="LPC1700 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <book    name="Documents/dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
        <description>
NXP's LPC1700 series are high performance MCUs for embedded applications featuring a high level of integration and low power consumption.
Typical applications include eMetering, Lighting, Industrial networking, Alarm systems, White goods and Motor control.

  - Quadrature Encoder interface,
  - Motor control PWM for three-phase motor
  - 2-input plus 2-output I2S-bus interface
  - Code Read Protection (CRP) with different security levels.
  - Unique device serial number
        </description>

        <feature type="Timer"         n="4"       m="32"/>
				
      <debugvars configfile="Debug/LPC17xx.dbgconf">
        // Debug Access Variables, can be modified by user via copy of SWO_Trace_LPC1768.dbgconf created by uVision.
        __var Dbg_CR      = 0x00000000;   // DBG_CR:
      </debugvars>				
		
