taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC1700_DFP.2.3.0.pdsc
      <sequences>

        <sequence name="ResetCatchClear">
          <block>
            // System Control Space (SCS) offset as defined
            // in ARMv6-M/ARMv7-M. Reimplement this sequence
            // if the SCS is located at a different offset.	  
            __var SCS_Addr   = 0xE000E000;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;

            // Disable Reset Vector Catch in DEMCR
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value &amp; (~0x00000001)));

            //Clear BP0 and FPB
            Write32(0xe0002008, 0);      						// Clear BP0
            Write32(0xe0002000, 0x00000002);  			// Disable FPB			  
          </block>
        </sequence>
    
        <sequence name="ResetCatchSet">
          <block>
            // System Control Space (SCS) offset as defined
            // in ARMv6-M/ARMv7-M. Reimplement this sequence
            // if the SCS is located at a different offset.
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;
            __var FPB_BKPT_H = 0x80000000;
            __var FPB_BKPT_L = 0x40000000;
            __var FPB_COMP_M = 0x1FFFFFFC;
            __var FPB_KEY = 0x00000002;
            __var FPB_ENABLE = 0x00000001;

            // Enable Reset Vector Catch in DEMCR
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value | 0x00000001));

            // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            Read32(DHCSR_Addr);
          </block>
          
          <control if="Dbg_CR &amp; 0x00000001" info="Stop after bootloader enabled">
            <block>
              // Run over Bootloader
              Write32(DEMCR_Addr, 0x00000000);                // Disable Reset Vector Catch
              Write32(0x400FC040, 0x00000001);   			  			// Map Flash to Vectors
              value = Read32 (0x00000004);           		  		// Read Reset Vector
            </block>
              
            <control if="value &lt; 0x20000000" info="">
              <block>
                // Set BP0 to Reset Vector
                value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
                Write32(0xe0002008, value);								      // Set BP0
                value = FPB_KEY | FPB_ENABLE;
                Write32(0xe0002000, value);								      // Enable FPB	
              </block>
            </control>
                
          </control>						
        </sequence>		

        <sequence name="DebugCodeMemRemap">
          <block>
            Write8 (0x400FC040, 0x01);
          </block>
        </sequence>	        

        <sequence name="TraceStart">          
          <control if="__traceout &amp; 0x00000002" info="Parallel Trace Port selected">
            <block>
              // TPIU interface enabled (PINSEL10)
              Write32 (0x4002C028, 0x00000008);
            </block>
          </control>                    
        </sequence>	 
        
        <sequence name="TraceStop">
          <control if="__traceout &amp; 0x00000002" info="Parallel Trace Port selected">
            <block>
              // TPIU interface disabled (PINSEL10)
              Write32 (0x4002C028, 0x00000000);
            </block>
          </control>   
        </sequence>        
   
      </sequences>		

      <!-- ************************  Subfamily 'LPC175x'  **************************** -->
      <subFamily DsubFamily="LPC175x">
        <feature type="ADC"           n="6"       m="12"/>
        <feature type="IOs"           n="52"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="2"                           name="SSP"/>
        <feature type="USART"         n="4"/>
        <feature type="USBD"          n="1"/>
      
      <!-- *************************  Device 'LPC1751'  ***************************** -->
      <device Dname="LPC1751">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>
      
      <!-- *************************  Device 'LPC1752'  ***************************** -->
      <device Dname="LPC1752">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>
      
      <!-- *************************  Device 'LPC1754'  ***************************** -->
      <device Dname="LPC1754">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="1"/>
      </device>
      
      <!-- *************************  Device 'LPC1756'  ***************************** -->
      <device Dname="LPC1756">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="2"/>
      </device>
      
      <!-- *************************  Device 'LPC1758'  ***************************** -->
      <device Dname="LPC1758">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="2"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      
