taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC1700_DFP.2.3.0.pdsc
      <!-- *************************  Device 'LPC1759'  ***************************** -->
      <device Dname="LPC1759">
        <processor Dclock="120000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1759_58_56_54_52_51.pdf"     title="LPC175x Data Sheet"/>
        <feature type="CAN"           n="2"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC176x'  **************************** -->
      <subFamily DsubFamily="LPC176x">
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="IOs"           n="70"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="2"                           name="SSP"/>
        <feature type="USART"         n="4"/>
      
      <!-- *************************  Device 'LPC1763'  ***************************** -->
      <device Dname="LPC1763">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1769_68_67_66_65_64_63.pdf"  title="LPC176x Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'LPC1764'  ***************************** -->
      <device Dname="LPC1764">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_128.FLM"    start="0x00000000"  size="0x20000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1769_68_67_66_65_64_63.pdf"  title="LPC176x Data Sheet"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="2"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      
      <!-- *************************  Device 'LPC1765'  ***************************** -->
      <device Dname="LPC1765">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1769_68_67_66_65_64_63.pdf"  title="LPC176x Data Sheet"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="2"/>
      </device>
      
      <!-- *************************  Device 'LPC1766'  ***************************** -->
      <device Dname="LPC1766">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_256.FLM"    start="0x00000000"  size="0x40000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1769_68_67_66_65_64_63.pdf"  title="LPC176x Data Sheet"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="2"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      
      <!-- *************************  Device 'LPC1767'  ***************************** -->
      <device Dname="LPC1767">
        <processor Dclock="100000000"/>
        <compile header="Device/Include/LPC17xx.h"  define="LPC175x_6x"/>
        <debug      svd="SVD/LPC176x5x.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x2007C000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/LPC_IAP_512.FLM"    start="0x00000000"  size="0x80000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents/LPC17xx_UM.pdf"                 title="LPC1700 Series Reference Manual"/>
        <book       name="Documents/LPC1769_68_67_66_65_64_63.pdf"  title="LPC176x Data Sheet"/>
        <feature type="ETH"           n="1"       m="100000000"/>
      </device>
      
