taboadaa/ShuQi/nRF/Packages/.cache/Keil.LPC1700_DFP.2.3.0.pdsc
    <condition id="LPC178x">
      <description>NXP LPC1780 Series devices</description>
      <require Dname="LPC178*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="LPC1700 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>NXP LPC1700 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Dname="LPC175*"/>
      <accept Dname="LPC176*"/>
    </condition>

    <condition id="LPC177x_8x CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>NXP LPC177x_8x Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Dname="LPC177*"/>
      <accept Dname="LPC178*"/>
    </condition>

    <condition id="LPC17xx CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>NXP LPC1700 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="LPC17*"/>
    </condition>

    <condition id="LPC17xx CMSIS Device ARMCC">
      <!-- conditions selecting Devices -->
      <description>NXP LPC1700 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="LPC17*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN">
      <description>NXP LPC1700 CMSIS with PIN</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

    <condition id="LPC177x_8x CMSIS PIN">
      <description>NXP LPC177x_8x CMSIS with PIN</description>
      <require condition="LPC177x_8x CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>

    <condition id="LPC17xx CMSIS PIN">
      <description>NXP LPC17xx CMSIS with PIN</description>
      <require condition="LPC17xx CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
    </condition>
    
    <condition id="LPC1700 CMSIS PIN GPDMA">
      <description>NXP LPC1700 CMSIS with PIN and GPDMA</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC177x_8x CMSIS PIN GPDMA">
      <description>NXP LPC177x_8x CMSIS with PIN and GPDMA</description>
      <require condition="LPC177x_8x CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC17xx CMSIS PIN GPDMA">
      <description>NXP LPC17xx CMSIS with PIN and GPDMA</description>
      <require condition="LPC17xx CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN GPIO">
      <description>NXP LPC1700 CMSIS with PIN and GPIO</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN GPIO GPDMA">
      <description>NXP LPC1700 CMSIS with PIN, GPIO and GPDMA</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC177x_8x CMSIS PIN GPIO">
      <description>NXP LPC177x_8x CMSIS with PIN and GPIO</description>
      <require condition="LPC177x_8x CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
    </condition>

    <condition id="LPC177x_8x CMSIS PIN GPIO GPDMA">
      <description>NXP LPC177x_8x CMSIS with PIN, GPIO and GPDMA</description>
      <require condition="LPC177x_8x CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC177x_8x CMSIS PIN GPIO I2C">
      <description>NXP LPC177x_8x CMSIS with PIN, GPIO and I2C</description>
      <require condition="LPC177x_8x CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0"/>
    </condition>

    <condition id="LPC177x_8x CMSIS PIN I2C">
      <description>NXP LPC177x_8x CMSIS with PIN and I2C</description>
      <require condition="LPC177x_8x CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN GPIO GPDMA SPI">
      <description>NXP LPC1700 CMSIS with PIN, GPIO, GPDMA and SPI</description>
      <require condition="LPC1700 CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.1.0"/>
    </condition>

    <condition id="LPC177x_8x CMSIS PIN GPIO GPDMA SPI">
      <description>NXP LPC177x_8x CMSIS with PIN, GPIO, GPDMA and SPI</description>
      <require condition="LPC177x_8x CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.1.0"/>
    </condition>

    <condition id="LPC1700 CMSIS PIN GPIO GPDMA SPI Display">
      <description>NXP LPC1700 CMSIS with PIN, GPIO, GPDMA, SPI and Display</description>
      <require condition="LPC1700 CMSIS PIN GPIO GPDMA SPI"/>
      <require Cclass="Graphics" Cgroup="Display" Csub="MCBQVGA*" Cvariant="SPI IF"/>
    </condition>

    <condition id="LPC177x_8x CMSIS I2C SAI">
      <description>NXP LPC177x_8x CMSIS with I2C and SAI driver</description>
      <require condition="LPC177x_8x CMSIS Device"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0"/>
      <require Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0.0"/>
      <accept Dname="LPC1756"/>
      <accept Dname="LPC1758"/>
      <accept Dname="LPC1759"/>
      <accept Dname="LPC1763"/>
      <accept Dname="LPC1765"/>
      <accept Dname="LPC1766"/>
      <accept Dname="LPC1767"/>
      <accept Dname="LPC1768"/>
      <accept Dname="LPC1769"/>
      <accept Dname="LPC1774"/>
      <accept Dname="LPC1776"/>
      <accept Dname="LPC1777"/>
      <accept Dname="LPC1778"/>
      <accept Dname="LPC1785"/>
      <accept Dname="LPC1786"/>
      <accept Dname="LPC1787"/>
      <accept Dname="LPC1788"/>
    </condition>

    <condition id="LPC17xx CAN">
      <description>NXP LPC1700 with CAN Controller</description>
      <require condition="LPC17xx CMSIS Device"/>
      <require Cclass="Device" Cgroup="PIN"/>
      <accept Dname="LPC1751"/>
      <accept Dname="LPC1752"/>
      <accept Dname="LPC1754"/>
      <accept Dname="LPC1756"/>
      <accept Dname="LPC1758"/>
      <accept Dname="LPC1759"/>
      <accept Dname="LPC1764"/>
      <accept Dname="LPC1765"/>
      <accept Dname="LPC1766"/>
      <accept Dname="LPC1768"/>
      <accept Dname="LPC1769"/>
      <accept Dname="LPC1774"/>
      <accept Dname="LPC1776"/>
      <accept Dname="LPC1777"/>
      <accept Dname="LPC1778"/>
      <accept Dname="LPC1785"/>
      <accept Dname="LPC1786"/>
      <accept Dname="LPC1787"/>
      <accept Dname="LPC1788"/>
    </condition>

